# -*-coding:utf-8 -*-
import pandas as pd
import os
from trainsample.converter import single_text, split_train_test

Idx2Label = {0: '乳房囊肿', 21: '小儿支气管肺炎', 42: '皮肤瘙痒',
 1: '乳腺增生', 22: '小儿消化不良', 43: '皮肤科其他',
 2: '乳腺疾病', 23: '小儿消化疾病', 44: '直肠肛管疾病',
 3: '乳腺肿瘤', 24: '小儿耳鼻喉其他', 45: '眼部疾病',
 4: '产前检查', 25: '小儿肺炎', 46: '神经内科其他',
 5: '儿童保健', 26: '心内科其他', 47: '微量元素缺乏',
 6: '先兆流产', 27: '心脏病', 48: '羊水异常',
 7: '内科其他', 28: '扁桃体炎', 49: '肺部疾病',
 8: '剖腹产', 29: '早孕反应', 50: '胃病',
 9: '发育迟缓', 30: '月经失调', 51: '脊柱退行性变',
 10: '呼吸内科其他', 31: '桥本甲状腺炎', 52: '腰椎间盘突出',
 11: '咽喉疾病', 32: '消化不良', 53: '腹泻',
 12: '喉疾病', 33: '消化内科其他', 54: '腹痛',
 13: '围产保健', 34: '消化道出血', 55: '膝关节半月板损',
 14: '外阴疾病', 35: '甲减', 56: '膝关节损伤',
 15: '妇科病', 36: '甲状腺功能异常', 57: '膝关节韧带损伤',
 16: '宫腔镜', 37: '甲状腺疾病', 58: '运动医学',
 17: '小儿呼吸系统疾病', 38: '甲状腺瘤', 59: '韧带损伤',
 18: '小儿咳嗽', 39: '甲状腺结节', 60: '骨科其他',
 19: '小儿感冒', 40: '痔疮',
 20: '小儿支气管炎', 41: '皮肤病'}


Label2Idx = dict([(j,i) for i,j in Idx2Label.items()])